[
    {
        "subhead": "Emotions!!"
    },
    {
        "p": "Is it too much to be an emotional being? I did think that was my weakness at one point in time. However, I was told emotions are what makes us what are the whole being."
    },
    {
        "p": "We love, we cry, we laugh, we hide- All of these are our emotions that feel from within."
    },
    {
        "p": "I do have felt various emotions and sometimes I fail to understand why these come to me at unwanted times. Then I realize that this is my mind telling me I need to concentrate on what I am feeling. We often as humans disregard these emotions and don’t pay attention to what we feel."
    },
    {
        "p": "If there is someone telling you they are sad/stressed/anxious or depressed, please do not disregard this. Everyone’s emotions are valid and if someone says they are anxious then they are."
    },
    {
        "p": "The last thing they want to hear is that ‘’Everything will be ok’’"
    },
    {
        "p": "NO- It’s not going to be ok. It will still be the same unless we do not validate our emotions and understand ourselves or others."
    },
    {
        "p": "Emotions are what make us what we are."
    },
    {
        "p": "Learn to address your emotions"
    },
    {
        "p": "And when someone tells us what you are feeling is not valid, you can ask them to take a step back because you do not need this kind of energy around you when all you want to be is heard."
    },
    {
        "p": "If keeping it within you is not causing any emotional damage and it could be handled very well, then you have reached a level of solitude."
    },
    {
        "p": "But when you pent up these emotions without letting the other person know how you feel is only going to break your own heart, and why would you want to do that?"
    },
    {
        "p": "Save yourself and reach out!"
    },
    {
        "p": "Regards,"
    },
    {
        "p": "Stay Blessed,"
    },
    {
        "p": "Stay Beautiful"
    },
    {
        "p": "Written by- Bonita Fernandes"
    },
    {
        "image": "/static/images/7cb29e5640f344ac949399bd6c78c38e.png"
    }
]