[
    {
        "subhead": "Self-Worth Reflection"
    },
    {
        "p": "Throughout my life, I have often felt like an option rather than a priority. This pattern traces back to my childhood, where I was frequently sidelined due to various factors. As a child, I thought this was normal and began molding myself to fit the expectations of others, hoping to be liked and accepted."
    },
    {
        "p": "This behavior carried into my adulthood and relationships. I never truly felt like anyone’s first choice or priority. It was never something I wanted to believe about myself, but it was a feeling that circumstances planted in my mind. Over time, my subconscious began to accept this narrative as truth. I became someone who prioritized pleasing others, thinking it was the only way to earn love and acceptance."
    },
    {
        "p": "I gave everything I had to relationships, hoping for just a little appreciation in return. They say the eldest children receive the most love from their parents, but that was not my experience. Instead, I was made to feel self-sufficient, and expected to manage on my own. If only I had been held a little longer in my mother’s arms, maybe I would have known that I was equally loved. I spent so much of my life looking for validation from those who mattered most to me, waiting for someone to tell me that I was loved and wanted."
    },
    {
        "p": "Some people in my life struggled to express their emotions, but I’ve realized that it was never my fault. Yet, I bore the weight of not receiving the validation I craved. The moments I was right and did things well were often overlooked, while the rare times I faltered were met with criticism."
    },
    {
        "p": "How is that fair? How is it fair that the love and recognition I yearned for felt so elusive?"
    },
    {
        "p": "Despite all of this, I am learning to rewrite the story in my mind. It was never about my worth—it was about circumstances and the limitations of others. Now, I am choosing to embrace my value, not through the eyes of others, but through my own. I am enough, just as I am, and I no longer need external validation to prove it."
    },
    {
        "p": " Bonita Fernandes"
    },
    {
        "image": "/static/images/f112ce6ea0534da1b5953ebcdb6477ea.png"
    }
]